In [1]:
people = {
    'first' : ['Jane', 'Mark', 'Sue'],
    'last' : ['Horse', 'John', 'Hill'],
    'email' : ['janehorse@gmail.com', 'markjohn@gmail.com', 'suehill@email.com']
    }

In [2]:
people['first']

['Jane', 'Mark', 'Sue']

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

  first   last                email
0  Jane  Horse  janehorse@gmail.com
1  Mark   John   markjohn@gmail.com
2   Sue   Hill    suehill@email.com

In [6]:
df['first'] + ' ' + df['last']

0    Jane Horse
1     Mark John
2      Sue Hill
dtype: object

In [7]:
df['full_name'] = df['first'] + ' ' + df['last']

In [8]:
df

  first   last                email   full_name
0  Jane  Horse  janehorse@gmail.com  Jane Horse
1  Mark   John   markjohn@gmail.com   Mark John
2   Sue   Hill    suehill@email.com    Sue Hill

In [10]:
df.drop(columns=['first', 'last'], inplace=True)

In [11]:
df

                 email   full_name
0  janehorse@gmail.com  Jane Horse
1   markjohn@gmail.com   Mark John
2    suehill@email.com    Sue Hill

In [13]:
df['full_name'].str.split(' ', expand=True)

      0      1
0  Jane  Horse
1  Mark   John
2   Sue   Hill

In [14]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [15]:
df

                 email   full_name first   last
0  janehorse@gmail.com  Jane Horse  Jane  Horse
1   markjohn@gmail.com   Mark John  Mark   John
2    suehill@email.com    Sue Hill   Sue   Hill

In [17]:
df.append({'first': 'Tony'}, ignore_index=True)

                 email   full_name first   last
0  janehorse@gmail.com  Jane Horse  Jane  Horse
1   markjohn@gmail.com   Mark John  Mark   John
2    suehill@email.com    Sue Hill   Sue   Hill
3                  NaN         NaN  Tony    NaN

In [20]:
people = {
    'first' : ['Tony', 'Steve'],
    'last' : ['Stark', 'Winter'],
    'email' : ['ironman@gmail.com', 'stevewinter@gmail.com']
}
df2 = pd.DataFrame(people)

In [21]:
df2

   first    last                  email
0   Tony   Stark      ironman@gmail.com
1  Steve  Winter  stevewinter@gmail.com

In [22]:
df.append(df2, ignore_index=True)

                   email   full_name  first    last
0    janehorse@gmail.com  Jane Horse   Jane   Horse
1     markjohn@gmail.com   Mark John   Mark    John
2      suehill@email.com    Sue Hill    Sue    Hill
3      ironman@gmail.com         NaN   Tony   Stark
4  stevewinter@gmail.com         NaN  Steve  Winter

In [23]:
df = df.append(df2, ignore_index=True)

In [24]:
df

                   email   full_name  first    last
0    janehorse@gmail.com  Jane Horse   Jane   Horse
1     markjohn@gmail.com   Mark John   Mark    John
2      suehill@email.com    Sue Hill    Sue    Hill
3      ironman@gmail.com         NaN   Tony   Stark
4  stevewinter@gmail.com         NaN  Steve  Winter

In [25]:
df.drop(index=4)

                 email   full_name first   last
0  janehorse@gmail.com  Jane Horse  Jane  Horse
1   markjohn@gmail.com   Mark John  Mark   John
2    suehill@email.com    Sue Hill   Sue   Hill
3    ironman@gmail.com         NaN  Tony  Stark

In [29]:
filt = df['last'] == 'Hill'
df.drop(index=df[filt].index)

                   email   full_name  first    last
0    janehorse@gmail.com  Jane Horse   Jane   Horse
1     markjohn@gmail.com   Mark John   Mark    John
3      ironman@gmail.com         NaN   Tony   Stark
4  stevewinter@gmail.com         NaN  Steve  Winter